#include <iostream>
#include "List.h"
int main()
{
	setlocale(LC_ALL, "Rus");
    List l1;
	int k=0,a=0;
	std::cout << "Введите кол-во элементов: "; std::cin >> k;
	if (k > 0)
	{
		std::cout << "Заполните список: \n";
		std::cin >> a;
		l1.initList(a);
		for (int i = 0; i < k - 1; ++i) {
			l1.print();
			std::cin >> a;
			l1.add(a);
		}
	}
	else { std::cout << "Неправильно введено количество элементов, производится завершение программы\n"; return 0; }
	l1.print();
	//___________________________________________________
	std::cout << "Проверка конструктора копирования \n";
	List l2(l1);
	l2.print();
	//___________________________________________________
	std::cout << "Проверка конструктора присваивания \n";
	l2.pop();
	l2.print();
	l2 = l1;
	l2.print();
	//проверка на самоприсваивание
	l1 = l1;
	//___________________________________________________
	std::cout << "Проверка оператора объединения \n";
	std::cout << "Введите кол-во элементов: "; std::cin >> k;
	if (k > 0)
	{
		std::cout << "Заполните список: \n";
		for (int i = 0; i < k ; ++i) {
			l2.print();
			std::cin >> a;
			l2.add(a);
		}
	}
	std::cout << "l2 "; l2.print();
	std::cout << "l1 "; l1.print();
	List l3(l1+l2);
	std::cout << "l3 "; l3.print();
	//__________________________________________________
	std::cout << "Проверка оператора пересечения \n";
	List l4(l1 * l2);
	std::cout << "l4 "; l4.print();
	//__________________________________________________
	std::cout << "Проверка оператора разности \n";
	List l5(l2/l1);
	std::cout << "l5 "; l5.print();
	//__________________________________________________
	std::cout << "Проверка оператора += \n";
	l4 += l5;
	std::cout << "l4+=l5 "; l4.print();
	//__________________________________________________
	std::cout << "Проверка оператора *= \n";
	l4 *= l5;
	std::cout << "l4*=l5 "; l4.print();
	//__________________________________________________
	std::cout << "Проверка оператора /= \n";
	l4 /= l5;
	std::cout << "l4/=l5 "; l4.print();
	//__________________________________________________
	std::cout << "Проверка оператора == \n";
	std::cout << "l5==l2 ";
	if (l5 == l2) std::cout<< 1<<std::endl; else std::cout << 0<<std::endl;
	//__________________________________________________
	std::cout << "Проверка оператора != \n";
	std::cout << "l5!=l1 ";
	if (l5 != l1) std::cout << 1 << std::endl; else std::cout << 0 << std::endl;
	//___________________________________________________
	std::cout << "Проверка оператора > \n";
	std::cout << "l2>l1 ";
	if (l2 > l1) std::cout << 1 << std::endl; else std::cout << 0 << std::endl;
	//___________________________________________________
	std::cout << "Проверка оператора < \n";
	std::cout << "l1<l2 ";
	if (l1 < l2) std::cout << 1 << std::endl; else std::cout << 0 << std::endl;
	//___________________________________________________
	std::cout << "Проверка оператора <= \n";
	std::cout << "l1<=l2 ";
	if (l1 <= l2) std::cout << 1 << std::endl; else std::cout << 0 << std::endl;
	std::cout << "l1<=l1 ";
	if (l1 <= l1) std::cout << 1 << std::endl; else std::cout << 0 << std::endl;
	//___________________________________________________
	std::cout << "Проверка оператора <= \n";
	std::cout << "l2>=l1 ";
	if (l2 >= l1) std::cout << 1 << std::endl; else std::cout << 0 << std::endl;
	std::cout << "l1>=l1 ";
	if (l1 >= l1) std::cout << 1 << std::endl; else std::cout << 0 << std::endl;
	//___________________________________________________

	return 0;
}